Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །བདག་ཀྱང་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱེད་ལ། གཞན་ཡང་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱ་བ་ལ་ཡང་དག་པར་བསྐུལ་ལོ། །བདག་ཀྱང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་ལ། གཞན་ཡང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བ་ལ་ཡང་དག་པར་བསྐུལ་ལོ།
en: They themselves bring beings to maturity, and they also encourage others to bring beings to maturity.

source: །བདག་ཀྱང་བྱང་ཆུབ་སེམས་དཔའི་མངོན་པར་ཤེས་པ་སྐྱེད་ལ། གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའི་མངོན་པར་ཤེས་པ་ལ་ཡང་དག་པར་བསྐུལ་ལོ།
en: They themselves develop the extrasensory powers of the bodhisattvas, and they also encourage others toward the extrasensory powers of the bodhisattvas.

source: །བདག་ཀྱང་གཟུངས་ཀྱི་སྒོ་ཡོངས་སུ་སྦྱོང་ལ། གཞན་ཡང་གཟུངས་ཀྱི་སྒོ་ཡོངས་སུ་སྦྱོང་བ་ལ་ཡང་དག་པར་བསྐུལ་ལོ།
en: They themselves refine the dhāraṇī gateways, and they also encourage others to refine the dhāraṇī gateways.

source: །བདག་ཀྱང་སྤོབས་པ་ཕུན་སུམ་ཚོགས་པ་ཐོབ་པར་བྱེད་ལ།
en: They themselves acquire excellent inspired speech, and they also encourage others toward excellent inspired speech.

source: གཞན་ཡང་སྤོབས་པ་ཕུན་སུམ་ཚོགས་པ་ལ་ཡང་དག་པར་བསྐུལ་ལོ། །བདག་ཀྱང་གཟུགས་ཕུན་སུམ་ཚོགས་པ་ཡོངས་སུ་འཛིན་པ། གཞན་ཡང་གཟུགས་ཕུན་སུམ་ཚོགས་པ་ཐོབ་པར་བྱ་བ་ལ་ཡང་དག་པར་བསྐུལ་ལོ།
en: They themselves assume an excellent physical form, and they also encourage others to acquire an excellent physical form.

source: །བདག་ཀྱང་མཚན་ཕུན་སུམ་ཚོགས་པ་ཡོངས་སུ་འཛིན་ལ། གཞན་ཡང་མཚན་ཕུན་སུམ་ཚོགས་པ་ཐོབ་པར་བྱ་བ་ལ་ཡང་དག་པར་བསྐུལ་ལོ།
en: They themselves assume the excellent major marks, and they also encourage others to acquire the excellent marks. {

source: །བདག་ཀྱང་གཞོན་ནུའི་ས་ཕུན་སུམ་ཚོགས་པ་ཡོངས་སུ་འཛིན་ལ་གཞན་ཡང་གཞོན་ནུའི་ས་ཕུན་སུམ་ཚོགས་པ་ལ་ཡང་དག་པར་བསྐུལ་ལོ།
en: Ki.IV: 21} They themselves assume the excellent status of a prince, and they also encourage others toward the excellent status of a prince.

source: །བདག་ཀྱང་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་སྒོམ་ལ། གཞན་ཡང་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ལ་ཡང་དག་པར་བསྐུལ་ལོ། །བདག་ཀྱང་འཕགས་པའི་བདེན་པ་བཞི་དང་། བསམ་གཏན་བཞི་དང་།
en: They themselves cultivate the thirty-seven factors conducive to enlightenment, and they also encourage others toward the thirty-seven factors conducive to enlightenment.

source: ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་ལྔ་སྒོམ་ལ། གཞན་ཡང་མངོན་པར་ཤེས་པ་ལྔ་ལ་ཡང་དག་པར་བསྐུལ་ལོ།
en: They themselves cultivate the four truths of the noble ones, the four meditative concentrations, the four immeasurable attitudes, the four formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, and the five extrasensory powers, and they also encourage others toward the five extrasensory powers [and so forth].

source: །བདག་ཀྱང་ཏིང་ངེ་འཛིན་ཐམས་ཅད་དང་། གཟུངས་ཀྱི་སྒོ་ཐམས་ཅད་སྒོམ་ལ། གཞན་ཡང་གཟུངས་ཀྱི་སྒོ་ཐམས་ཅད་ལ་ཡང་དག་པར་བསྐུལ་ལོ། །བདག་ཀྱང་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་།
en: They themselves cultivate all the meditative stabilities and all the dhāraṇī gateways, and they also encourage others toward all the dhāraṇī gateways [and so forth].

source: སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་སྒྲུབ་ལ། གཞན་ཡང་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ལ་ཡང་དག་པར་བསྐུལ་ལོ།
en: They themselves achieve the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, and the eighteen distinct qualities of the buddhas, and they also encourage others toward the eighteen distinct qualities of the buddhas [and so forth].

source: །བདག་ཀྱང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་བྱེད་ལ། གཞན་ཡང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་ཡང་དག་པར་བསྐུལ་ལོ།
en: They themselves attain all-aspect omniscience, and they also encourage others toward all-aspect omniscience.

source: །བདག་ཀྱང་བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བའི་ཉོན་མོངས་པ་ཐམས་ཅད་རབ་ཏུ་སྤོང་ལ། གཞན་ཡང་བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བའི་ཉོན་མོངས་པ་ཐམས་ཅད་སྤོང་བ་ལ་ཡང་དག་པར་བསྐུལ་ལོ།
en: They themselves abandon all afflictive mental states associated with reincarnation through [past] propensities, and they also encourage others to abandon all afflictive mental states associated with reincarnation through [past] propensities.

source: །བདག་ཀྱང་ཆོས་ཀྱི་འཁོར་ལོ་སྐོར་ལ། གཞན་ཡང་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་ལ་ཡང་དག་པར་བསྐུལ་ལོ། །དེ་སྐད་ཅེས་བཀའ་སྩལ་པ་དང་། ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས།
en: They themselves turn the wheel of the Dharma, and they also encourage others to turn the wheel of the Dharma.”

source: བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཡོན་ཏན་མང་པོ་དང་ལྡན་པ་དེ་དག་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སླད་དུ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་ནི། བཅོམ་ལྡན་འདས་ངོ་མཚར་ཏོ་བདེ་བར་གཤེགས་པ་ངོ་མཚར་ཏོ།
en: The venerable Subhūti then said to the Blessed One, “It is wonderful, Blessed Lord, it is wonderful, Sugata, that those bodhisattva great beings endowed with many attributes practice the perfection of wisdom and attain consummate buddhahood in unsurpassed, complete enlightenment for the sake of all beings!

source: །བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་སྒོམ་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་བ་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, how will the cultivation of the perfection of wisdom that bodhisattva great beings have be perfected?” “

source: རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ནམ་གཟུགས་ཀྱི་འཕེལ་བ་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་བ་དང་། ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པའི་འཕེལ་བ་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་བ་དེའི་ཚེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྒོམ་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ནམ་སྐྱེ་མཆེད་དང་ཁམས་དང་།
en: Subhūti,” replied the Blessed One, “while bodhisattva great beings are practicing the perfection of wisdom, when they do not observe the enhancement of physical forms, and when they do not observe the enhancement of feelings, perceptions, formative predispositions, or consciousness, then the cultivation of the perfection of wisdom that bodhisattva great beings have will be perfected.

source: རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའི་འཕེལ་བ་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་བ་དང་། ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་གྱི་འཕེལ་བ་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་བ་དེའི་ཚེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྒོམ་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །ནམ་འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་།
en: Subhūti, while bodhisattva great beings are practicing the perfection of wisdom, when they do not observe the enhancement of the sense fields, the sensory elements, or the links of dependent origination, and when they do not observe the enhancement of all the perfections, all the aspects of emptiness, or the thirty-seven factors conducive to enlightenment, then the cultivation of the perfection of wisdom that bodhisattva great beings have will be perfected.

source: ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་།
en: When they do not observe the enhancement of the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, or the extrasensory powers, then the cultivation of the perfection of wisdom that bodhisattva great beings have will be perfected. {

source: མཚན་མ་མེད་པ་དང་།
en: Ki.

source: སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་ཀྱི་འཕེལ་བ་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་བ་དེའི་ཚེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྒོམ་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །ནམ་ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ཀྱི་འཕེལ་བ་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་བ་དེའི་ཚེ།
en: IV: 22} When they do not observe the enhancement of the meditative stabilities or the dhāraṇī gateways, then the cultivation of the perfection of wisdom that bodhisattva great beings have will be perfected.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྒོམ་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །ནམ་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་འཕེལ་བ་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་བ་དེའི་ཚེ།
en: When they do not observe the enhancement of the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, or the eighteen distinct qualities of the buddhas, then the cultivation of the perfection of wisdom that bodhisattva great beings have will be perfected.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྒོམ་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་གྱི་འཕེལ་བ་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་བ་དེའི་ཚེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྒོམ་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: Subhūti, while bodhisattva great beings are practicing the perfection of wisdom, when they do not observe the enhancement of [the goals], up to and including all-aspect omniscience, then the cultivation of the perfection of wisdom that bodhisattva great beings have will be perfected. “

source: །རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ནམ་གཟུགས་ཀྱི་འགྲིབ་པ་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་བ་དང་། ཚོར་བ་དང་། འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པའི་འགྲིབ་པ་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་བ་དེའི་ཚེ།
en: Subhūti, while bodhisattva great beings are practicing the perfection of wisdom, when they do not observe the diminution of physical forms and when they do not observe the diminution of feelings, perceptions, formative predispositions, or consciousness, then the cultivation of the perfection of wisdom that bodhisattva great beings have will be perfected.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྒོམ་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །ནམ་སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའི་འགྲིབ་པ་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་བ་དེའི་ཚེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྒོམ་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: When they do not observe the diminution of the sense fields, the sensory elements, or the links of dependent origination, then the cultivation of the perfection of wisdom that bodhisattva great beings have will be perfected.

source: །ནམ་ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་དང་སྟོང་པ་ཉིད་ཐམས་ཅད་དང་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་གྱི་འགྲིབ་པ་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་བ་དེའི་ཚེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྒོམ་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །ནམ་འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་།
en: When they do not observe the diminution of all the perfections, all the aspects of emptiness, or the thirty-seven factors conducive to enlightenment, then the cultivation of the perfection of wisdom that bodhisattva great beings have will be perfected.

source: མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་ཀྱི་འགྲིབ་པ་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་བ་དེའི་ཚེ།
en: When they do not observe the diminution of the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, or the extrasensory powers, then the cultivation of the perfection of wisdom that bodhisattva great beings have will be perfected.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྒོམ་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །ནམ་ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ཀྱི་འགྲིབ་པ་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་བ་དེའི་ཚེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྒོམ་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: When they do not observe the diminution of the meditative stabilities or the dhāraṇī gateways, then the cultivation of the perfection of wisdom that bodhisattva great beings have will be perfected.

source: །ནམ་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ཀྱི་འགྲིབ་པ་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་བ་དེའི་ཚེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྒོམ་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: When they do not observe the diminution of the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, or the eighteen distinct qualities of the buddhas, then the cultivation of the perfection of wisdom that bodhisattva great beings have will be perfected.

source: །ནམ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་གྱི་འགྲིབ་པ་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་བ་དེའི་ཚེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བསྒོམ་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཆོས་ཤེས་བྱ་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་། ཆོས་མ་ཡིན་ཞེས་བྱ་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་། འདས་ཤེས་བྱ་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་། མ་འོངས་ཤེས་བྱ་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་། ད་ལྟར་བྱུང་ཞེས་བྱ་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་། དགེ་ཞེས་བྱ་བ་དང་མི་དགེ་ཞེས་བྱ་བ་དང་། ལུང་དུ་སྟོན་ཞེས་བྱ་བ་དང་། ལུང་དུ་མི་སྟོན་ཅེས་བྱ་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་། འདུས་བྱས་ཞེས་བྱ་བ་དང་འདུས་མ་བྱས་ཤེས་བྱ་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་། འདོད་པའི་ཁམས་ཤེས་བྱ་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་།
en: When they do not observe the diminution of [the goals], up to and including all-aspect omniscience, then the cultivation of the perfection of wisdom that bodhisattva great beings have will be perfected. “

source: གཟུགས་ཀྱི་ཁམས་ཤེས་བྱ་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་། གཟུགས་མེད་པའི་ཁམས་ཤེས་བྱ་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཞེས་བྱ་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཞེས་བྱ་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ཞེས་བྱ་བར་ཡང་དག་པར་རྗེས་སུ་མི་མཐོང་བ་དེའི་ཚེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསྒོམ་པ་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ།
en: Moreover, Subhūti, while bodhisattva great beings are practicing the perfection of wisdom, when they do not observe the notion of phenomena; do not observe the notion of nonphenomena; do not observe the notion of the past; do not observe the notion of the future; do not observe the notion of the present; do not observe the notion of virtuous action, the notion of nonvirtuous action, or the notion of indeterminate action; do not observe the notion of conditioned phenomena or the notion of unconditioned phenomena; do not observe the notion of the realm of desire; do not observe the notion of the realm of form; do not observe the notion of the realm of formlessness; do not observe the notion of the perfection of generosity; do not observe the notions of the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, or the perfection of wisdom; and do not observe the notion of [the goals], up to and including all-aspect omniscience, then the cultivation of the perfection of wisdom that bodhisattva great beings have will be perfected. “

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་ཆོས་རྣམས་ཀྱི་ཆོས་ཀྱི་མཚན་ཉིད་དང་། ཕྱིར་ལྡོག་པ་མེད་པ་དང་གསོག་དང་གསོབ་དང་སྙིང་པོ་མེད་པ་དང་། དབང་དུ་གྱུར་པ་དང་བྱེད་པ་མེད་པ་དང་སྲོག་མེད་པའི་ཕྱིར་རོ། །གསོལ་པ།
en: If you ask why, Subhūti, it is owing to the defining characteristics of all phenomena, and owing to irreversibility, voidness, hollowness, essencelessness, impotence, and lifelessness.” “

source: བཅོམ་ལྡན་འདས་བསམ་གྱིས་མི་ཁྱབ་པ་བསྟན་ཏོ།
en: Blessed Lord, the inconceivable is being revealed!” said Subhūti. “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་གཟུགས་བསམ་གྱིས་མི་ཁྱབ་པའི་ཕྱིར། བསམ་གྱིས་མི་ཁྱབ་པ་བསྟན་ཏོ།
en: Subhūti,” replied the Blessed One, “the inconceivable is revealed owing to the inconceivability of physical forms.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་བསམ་གྱིས་མི་ཁྱབ་པའི་ཕྱིར། བསམ་གྱིས་མི་ཁྱབ་པ་བསྟན་ཏོ།
en: The inconceivable is revealed owing to the inconceivability of feelings, perceptions, {Ki.

source: །རབ་འབྱོར་སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བ་བསམ་གྱིས་མི་ཁྱབ་པའི་ཕྱིར་བསམ་གྱིས་མི་ཁྱབ་པ་བསྟན་ཏོ།
en: IV: 23} formative predispositions, and consciousness. Subhūti, the inconceivable is revealed owing to the inconceivability of the sense fields, the sensory elements, and the links of dependent origination.

source: །རབ་འབྱོར་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་བསམ་གྱིས་མི་ཁྱབ་པའི་ཕྱིར། བསམ་གྱིས་མི་ཁྱབ་པ་བསྟན་ཏོ།
en: Subhūti, the inconceivable is revealed owing to the inconceivability of the perfection of generosity.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་བསམ་གྱིས་མི་ཁྱབ་པའི་ཕྱིར།
en: The inconceivable is revealed owing to the inconceivability of the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom.

source: བསམ་གྱིས་མི་ཁྱབ་པ་བསྟན་ཏོ། །རབ་འབྱོར་ནང་སྟོང་པ་ཉིད་བསམ་གྱིས་མི་ཁྱབ་པའི་ཕྱིར་བསམ་གྱིས་མི་ཁྱབ་པ་བསྟན་ཏོ།
en: Subhūti, the inconceivable is revealed owing to the inconceivability of the emptiness of internal phenomena.

source: །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་བསམ་གྱིས་མི་ཁྱབ་པའི་ཕྱིར། བསམ་གྱིས་མི་ཁྱབ་པ་བསྟན་ཏོ།
en: The inconceivable is revealed owing to the inconceivability of [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities.

source: །རབ་འབྱོར་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་བསམ་གྱིས་མི་ཁྱབ་པའི་ཕྱིར། བསམ་གྱིས་མི་ཁྱབ་པ་བསྟན་ཏོ། །འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་།
en: Subhūti, the inconceivable is revealed owing to the inconceivability of the thirty-seven factors conducive to enlightenment.

source: གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་བསམ་གྱིས་མི་ཁྱབ་པའི་ཕྱིར།
en: The inconceivable is revealed owing to the inconceivability of the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, and the extrasensory powers.

source: བསམ་གྱིས་མི་ཁྱབ་པ་བསྟན་ཏོ། །ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་བསམ་གྱིས་མི་ཁྱབ་པའི་ཕྱིར།
en: The inconceivable is revealed owing to the inconceivability of the meditative stabilities and the dhāraṇī gateways.

source: བསམ་གྱིས་མི་ཁྱབ་པ་བསྟན་ཏོ། །དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་བསམ་གྱིས་མི་ཁྱབ་པའི་ཕྱིར།
en: The inconceivable is revealed owing to the inconceivability of the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, and the eighteen distinct qualities of the buddhas.

source: བསམ་གྱིས་མི་ཁྱབ་པ་བསྟན་ཏོ། །རབ་འབྱོར་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་བསམ་གྱིས་མི་ཁྱབ་པའི་ཕྱིར། བསམ་གྱིས་མི་ཁྱབ་པ་བསྟན་ཏོ།
en: Subhūti, the inconceivable is revealed owing to the inconceivability of [the goals], up to and including all-aspect omniscience. “

source: །རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། གལ་ཏེ་གཟུགས་བསམ་གྱིས་མི་ཁྱབ་ཅེས་བྱ་བར་འདུ་ཤེས་པ་མེད། ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་བསམ་གྱིས་མི་ཁྱབ་ཅེས་བྱ་བར་འདུ་ཤེས་པ་མེད་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པའོ།
en: Subhūti, when bodhisattva great beings are practicing the perfection of wisdom, if they do not perceive the notion that physical forms are inconceivable, and if they do not perceive that feelings, perceptions, formative predispositions, and consciousness are inconceivable, then they are perfecting the perfection of wisdom.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། གལ་ཏེ་སྐྱེ་མཆེད་དང་ཁམས་དང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་བསམ་གྱིས་མི་ཁྱབ་ཅེས་བྱ་བར་འདུ་ཤེས་པ་མེད་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པའོ། །ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་།
en: When bodhisattva great beings are practicing the perfection of wisdom, if they do not perceive the notion that the sense fields, the sensory elements, and the links of dependent origination are inconceivable, then they are perfecting the perfection of wisdom.

source: བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་བསམ་གྱིས་མི་ཁྱབ་ཅེས་བྱ་བར་འདུ་ཤེས་པ་མེད་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པའོ། །གལ་ཏེ་འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་།
en: If they do not perceive the notion that all the perfections, all the aspects of emptiness, and the thirty-seven factors conducive to enlightenment are inconceivable, then they are perfecting the perfection of wisdom.

source: རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་བསམ་གྱིས་མི་ཁྱབ་ཅེས་བྱ་བར་འདུ་ཤེས་པ་མེད་ན།
en: If they do not perceive the notion that the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, and the extrasensory powers are inconceivable, then they are perfecting the perfection of wisdom.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པའོ། །གལ་ཏེ་ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་བསམ་གྱིས་མི་ཁྱབ་ཅེས་བྱ་བར་འདུ་ཤེས་པ་མེད་ན།
en: If they do not perceive the notion that the meditative stabilities and the dhāraṇī gateways are inconceivable, then they are perfecting the perfection of wisdom.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པའོ། །གལ་ཏེ་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་བསམ་གྱིས་མི་ཁྱབ་ཅེས་བྱ་བར་འདུ་ཤེས་པ་མེད་ན།
en: If they do not perceive the notion that the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, and the eighteen distinct qualities of the buddhas are inconceivable, then they are perfecting the perfection of wisdom.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པའོ། །གལ་ཏེ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་བསམ་གྱིས་མི་ཁྱབ་ཅེས་བྱ་བར་འདུ་ཤེས་པ་མེད་ན། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡོངས་སུ་རྫོགས་པར་བྱེད་པའོ།
en: If they do not perceive the notion that [the goals], up to and including all-aspect omniscience, are inconceivable, then they are perfecting the perfection of wisdom.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལ་སུ་ཞིག་མོས་པར་འགྱུར་བ་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, who will be devoted to this profound perfection of wisdom? “

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཕ་རོལ་དུ་ཕྱིན་པ་དྲུག་ལ་སྤྱད་པ། དགེ་བའི་རྩ་བ་བསྐྱེད་པར་གྱུར་པ། སངས་རྒྱས་མང་པོ་ལ་བསྙེན་བཀུར་བ། དགེ་བའི་བཤེས་གཉེན་གྱིས་ཡོངས་སུ་བཟུང་བ་དེ་དག་ནི། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལ་མོས་པར་འགྱུར་རོ།
en: Bodhisattva great beings who have practiced the six perfections, who have grown the roots of virtuous action, venerated many buddhas, and been accepted by spiritual mentors will be devoted to this profound perfection of wisdom,” replied the Blessed One. “
